Tekla Open API Reference for Tekla Structures 2025
LayoutAttributes Properties
The LayoutAttributes type exposes the following members.
Properties
Name | Description
AutoSizeOptions
 Gets or sets the auto size options that control the drawing sheet size. Setting this property will change the SizeDefinitionMode to AutoSize.
ListHiddenObjectsInTemplates
 Gets or sets the property for controlling whether to list hidden objects in templates.
SheetSize
 Gets or sets the sheet size. Setting this property will change the SizeDefinitionMode to SpecifiedSize.
SizeDefinitionMode
 Gets or sets the size definition mode.
Top
See Also
Reference
LayoutAttributes Class
Tekla.Structures.Drawing Namespace